IanBallinger/Robotics_final_spring2026_thursPM/mobile_robot/src/esp32/src/elevator/elevator_control.cpp
static float clampFloat(float value, float min_value, float max_value) {
  if (value < min_value) {
    return min_value;
  }
  if (value > max_value) {
    return max_value;
  }
  return value;
}

static float convertShoulderAngleToMicroseconds(const float shoulder_angle) {
  return 1360 + shoulder_angle * (600.0 / 90.0);
}

static float convertElbowAngleToMicroseconds(const float elbow_angle) {
  return 1090 - elbow_angle * (599.0 / 90.0);
}

static bool handleElevatorCommand(const String& line, DesiredElevatorState& cmd) {
  if (!line.startsWith("ELV_CMD,")) {
    return false;
  }

  if (sscanf(line.c_str(), "ELV_CMD,%f", &cmd.height_m) != 1) {
    Serial.println("WRONG_NUM_VALUES");
    return false;
  }

  return true;
}

static bool handleArmCommand(const String& line, DesiredArmPosition& cmd) {
  if (!line.startsWith("ARM_CMD,")) {
    return false;
  }

  if (sscanf(line.c_str(), "ARM_CMD,%f,%f", &cmd.xE, &cmd.yE) != 2) {
    Serial.println("WRONG_NUM_VALUES");
    return false;
  }

  return true;
}

static bool handleEncoderHeightInitCommand(const String& line, float& measured_height_m) {
  if (!line.startsWith("ELV_ENC_INIT,")) {
    return false;
  }

  if (sscanf(line.c_str(), "ELV_ENC_INIT,%f", &measured_height_m) != 1) {
    Serial.println("WRONG_NUM_VALUES");
    return false;
  }

  return true;
}

static bool handleArmJointAnglesCommand(const String& line, DesiredArmJointAngles& cmd) {
  if (!line.startsWith("ARM_JOINT_ANGLES_CMD,")) {
    return false;
  }

  if (sscanf(line.c_str(), "ARM_JOINT_ANGLES_CMD,%f,%f", &cmd.theta1, &cmd.theta2) != 2) {
    Serial.println("WRONG_NUM_VALUES");
    return false;
  }

  return true;
}

static bool handleElevatorJogCommand(const String& line, DesiredElevatorJogCommand& cmd) {
  if (!line.startsWith("ELV_JOG_CMD,")) {
    return false;
  }

  if (sscanf(line.c_str(), "ELV_JOG_CMD,%f", &cmd.drive) != 1) {
    Serial.println("WRONG_NUM_VALUES");
    return false;
  }

  cmd.drive = clampFloat(cmd.drive, -1.0f, 1.0f);
  return true;
}

static bool handlePinchCommand(const String& line, PinchCommand& cmd) {
  if (!line.startsWith("PINCH_CMD,")) {
    return false;
  }

  if (line == "PINCH_CMD,OPEN") {
    cmd = PinchCommand::OPEN;
    return true;
  }
  if (line == "PINCH_CMD,CLOSE") {
    cmd = PinchCommand::CLOSE;
    return true;
  }

  Serial.println("WRONG_NUM_VALUES");
  return false;
}

static bool decodeWirelessControllerMessage(const uint8_t* incomingData, int len) {
  if (len != sizeof(ControllerMessage)) {
    return false;
  }

  ControllerMessage msg;
  memcpy(&msg, incomingData, sizeof(msg));

  float jog_drive = 0.0f;
  if (msg.joystick2.x >= ELEVATOR_JOG_COMMAND_THRESHOLD) {
    jog_drive = 1.0f;
  } else if (msg.joystick2.x <= -ELEVATOR_JOG_COMMAND_THRESHOLD) {
    jog_drive = -1.0f;
  }
  pending_wireless_elevator_jog_drive = clampFloat(jog_drive, -1.0f, 1.0f);
  has_pending_wireless_elevator_jog_cmd = true;

  if (msg.joystick2.y >= PINCH_COMMAND_THRESHOLD) {
    pending_wireless_pinch_cmd = PinchCommand::OPEN;
    has_pending_wireless_pinch_cmd = true;
  } else if (msg.joystick2.y <= -PINCH_COMMAND_THRESHOLD) {
    pending_wireless_pinch_cmd = PinchCommand::CLOSE;
    has_pending_wireless_pinch_cmd = true;
  }

  Serial.print("CTRL_RX,joy2x,");
  Serial.print(msg.joystick2.x, 3);
  Serial.print(",joy2y,");
  Serial.print(msg.joystick2.y, 3);
  Serial.print(",jog,");
  Serial.println(pending_wireless_elevator_jog_drive, 3);
  return true;
}

static float readTofElevatorHeightMeters() {
  if (!ELEVATOR_USE_TOF_SENSOR || !tof_sensor_available) {
    return NAN;
  }

  tcaSelect(TOF_MUX_CHANNEL);
  VL53L0X_RangingMeasurementData_t measure;
  lox.rangingTest(&measure, false);

  if (measure.RangeStatus == 4) {
    return NAN;
  }

  return static_cast<float>(measure.RangeMilliMeter) * MM_TO_M;
}

static void initializeEncoderHeightReference(float measured_height_m) {
  encoder_zero_height_m = measured_height_m;
  encoder_zero_position_rad = ELEVATOR_ENCODER_SIGN * elevator_encoder.getPosition();
  encoder_height_initialized = true;

  const float encoder_height_m = readEncoderHeightMeters();
  fused_elevator_height_m = encoder_height_m;
  last_encoder_height_m = encoder_height_m;
  last_encoder_height_valid = !isnan(encoder_height_m);
  elevator_height_filter_initialized = !isnan(encoder_height_m);
  last_height_update_ms = millis();
}

static void maybeInitializeEncoderHeight(float tof_height_m) {
  if (encoder_height_initialized || isnan(tof_height_m)) {
    return;
  }
  initializeEncoderHeightReference(tof_height_m + ELEVATOR_METERS_BIAS);
}

static float readEncoderHeightMeters() {
  if (!encoder_height_initialized) {
    return NAN;
  }
  const float position_rad = ELEVATOR_ENCODER_SIGN * elevator_encoder.getPosition();
  return encoder_zero_height_m +
         (position_rad - encoder_zero_position_rad) * ELEVATOR_METERS_PER_RAD;
}

static float readElevatorHeightMeters() {
  const unsigned long now_ms = millis();
  const float tof_height_m = readTofElevatorHeightMeters();
  last_tof_height_m = tof_height_m;

  if (!encoder_height_initialized && !ELEVATOR_USE_TOF_SENSOR) {
    initializeEncoderHeightReference(0.0f);
    Serial.println("ELV_ENC_INIT,zero_reference");
  }

  maybeInitializeEncoderHeight(tof_height_m);

  const float encoder_height_m = readEncoderHeightMeters();

  if (!elevator_height_filter_initialized) {
    if (!ELEVATOR_USE_TOF_SENSOR && !isnan(encoder_height_m)) {
      fused_elevator_height_m = encoder_height_m;
      last_encoder_height_m = encoder_height_m;
      last_encoder_height_valid = true;
      elevator_height_filter_initialized = true;
    } else if (!isnan(tof_height_m)) {
      fused_elevator_height_m = tof_height_m;
      if (!isnan(encoder_height_m)) {
        last_encoder_height_m = encoder_height_m;
        last_encoder_height_valid = true;
      }
      elevator_height_filter_initialized = true;
    } else if (!isnan(encoder_height_m)) {
      fused_elevator_height_m = encoder_height_m;
      last_encoder_height_m = encoder_height_m;
      last_encoder_height_valid = true;
      elevator_height_filter_initialized = true;
    }
    last_height_update_ms = now_ms;
    return fused_elevator_height_m;
  }

  const float dt_s = (last_height_update_ms == 0 || now_ms <= last_height_update_ms)
                         ? 0.0f
                         : (now_ms - last_height_update_ms) * 0.001f;
  last_height_update_ms = now_ms;

  float estimated_height_m = fused_elevator_height_m;

  if (!isnan(encoder_height_m)) {
    if (last_encoder_height_valid && dt_s > 0.0f) {
      const float encoder_delta_m = encoder_height_m - last_encoder_height_m;
      const float max_allowed_delta_m =
          ELEVATOR_ENCODER_MAX_SPEED_MPS * dt_s + ELEVATOR_ENCODER_JUMP_MARGIN_M;
      if (fabsf(encoder_delta_m) <= max_allowed_delta_m) {
        estimated_height_m = fused_elevator_height_m + encoder_delta_m;
      }
    } else {
      estimated_height_m = encoder_height_m;
    }

