IanBallinger/Robotics_final_spring2026_thursPM/mobile_robot/src/esp32/src/elevator/elevator_control.cpp
    last_encoder_height_m = encoder_height_m;
    last_encoder_height_valid = true;
  } else {
    last_encoder_height_valid = false;
  }

  if (ELEVATOR_USE_TOF_SENSOR && !isnan(tof_height_m)) {
    if (isnan(estimated_height_m)) {
      estimated_height_m = tof_height_m;
    } else {
      estimated_height_m +=
          ELEVATOR_TOF_CORRECTION_GAIN * (tof_height_m - estimated_height_m);
    }

    if (!isnan(encoder_height_m) &&
        fabsf(tof_height_m - encoder_height_m) <= ELEVATOR_ENCODER_REANCHOR_WINDOW_M) {
      encoder_zero_height_m +=
          ELEVATOR_ENCODER_REANCHOR_GAIN * (tof_height_m - encoder_height_m);
      last_encoder_height_m = readEncoderHeightMeters();
    }
  }

  fused_elevator_height_m = estimated_height_m;
  return fused_elevator_height_m;
}

static void applyElevatorCommand(const DesiredElevatorState& cmd,
                                 float measured_height_m,
                                 float jog_drive = 0.0f,
                                 float dt_jog_s = 0.0f) {
  latest_applied_cmd = cmd;

  double control_effort = pid.calculateParallel(measured_height_m, cmd.height_m);
  elevator_driver.drive(control_effort);
  Serial.print("ELV_CTRL_EFF,");
  Serial.println(control_effort, 4);
  printElevatorControlDebug("APPLY", measured_height_m, cmd.height_m, jog_drive, dt_jog_s, control_effort);
}

static void printElevatorAck(const DesiredElevatorState& cmd) {
  printDebugTiming("ELV_ACK", last_ack_debug_ms);
  Serial.print("ELV_ACK,");
  Serial.println(cmd.height_m, 4);
}

static bool moveArmToJointAngles(float theta1_rad, float theta2_rad) {
  float shoulder_deg = theta1_rad * RAD_TO_DEG_FACTOR;
  float elbow_deg = theta2_rad * RAD_TO_DEG_FACTOR;

  shoulder_deg = clampFloat(shoulder_deg, SHOULDER_MIN_DEG, SHOULDER_MAX_DEG);
  elbow_deg = clampFloat(elbow_deg, ELBOW_MIN_DEG, ELBOW_MAX_DEG);

  shoulder_ms = convertShoulderAngleToMicroseconds(shoulder_deg);
  elbow_ms = convertElbowAngleToMicroseconds(elbow_deg);

  shoulder_servo.writeMicroseconds(shoulder_ms);
  elbow_servo.writeMicroseconds(elbow_ms);
  return true;
}

static bool commandArmToJointAngles(const DesiredArmJointAngles& cmd) {
  target_shoulder_rad = cmd.theta1;
  target_elbow_rad = cmd.theta2;
  has_valid_arm_target = true;

  Serial.print("ARM_JOINT_ACK,");
  Serial.print(cmd.theta1, 4);
  Serial.print(",");
  Serial.print(cmd.theta2, 4);
  Serial.print(",");
  Serial.print(target_shoulder_rad * RAD_TO_DEG_FACTOR, 2);
  Serial.print(",");
  Serial.print(target_elbow_rad * RAD_TO_DEG_FACTOR, 2);
  Serial.print(",");
  Serial.print(applied_shoulder_rad * RAD_TO_DEG_FACTOR, 2);
  Serial.print(",");
  Serial.println(applied_elbow_rad * RAD_TO_DEG_FACTOR, 2);
  return true;
}

static bool commandPinch(PinchCommand cmd) {
  const float pinch_angle_deg_l =
      (cmd == PinchCommand::CLOSE) ? PINCH_CLOSE_ANGLE_DEG_L : PINCH_OPEN_ANGLE_DEG_L;
  const float pinch_angle_deg_r =
      (cmd == PinchCommand::CLOSE) ? PINCH_CLOSE_ANGLE_DEG_R : PINCH_OPEN_ANGLE_DEG_R;
  const float left_angle_deg = clampFloat(-pinch_angle_deg_l, ELBOW_MIN_DEG, ELBOW_MAX_DEG);
  const float right_angle_deg = clampFloat(pinch_angle_deg_r, ELBOW_MIN_DEG, ELBOW_MAX_DEG);

  pinch_left_ms = convertElbowAngleToMicroseconds(left_angle_deg);
  pinch_right_ms = convertShoulderAngleToMicroseconds(right_angle_deg);

  pinch_left_servo.writeMicroseconds(pinch_left_ms);
  pinch_right_servo.writeMicroseconds(pinch_right_ms);

  Serial.print("PINCH_DBG,cmd,");
  Serial.print((cmd == PinchCommand::CLOSE) ? "CLOSE" : "OPEN");
  Serial.print(",left_angle_deg,");
  Serial.print(left_angle_deg, 2);
  Serial.print(",right_angle_deg,");
  Serial.print(right_angle_deg, 2);
  Serial.print(",left_us,");
  Serial.print(pinch_left_ms, 1);
  Serial.print(",right_us,");
  Serial.println(pinch_right_ms, 1);

  Serial.print("PINCH_ACK,");
  Serial.print((cmd == PinchCommand::CLOSE) ? "CLOSE" : "OPEN");
  Serial.print(",");
  Serial.print(left_angle_deg, 2);
  Serial.print(",");
  Serial.print(right_angle_deg, 2);
  Serial.print(",");
  Serial.print(pinch_left_ms, 1);
  Serial.print(",");
  Serial.println(pinch_right_ms, 1);
  return true;
}

static float stepToward(float current_value, float target_value, float max_step) {
  const float error = target_value - current_value;
  if (fabsf(error) <= max_step) {
    return target_value;
  }
  return current_value + copysignf(max_step, error);
}

static void updateArmMotion(unsigned long now_ms) {
  if (!has_valid_arm_target) {
    return;
  }
  if (last_arm_update_ms != 0 && now_ms - last_arm_update_ms < ARM_UPDATE_PERIOD_MS) {
    return;
  }

  const float dt_s = (last_arm_update_ms == 0)
                         ? (ARM_UPDATE_PERIOD_MS * 0.001f)
                         : ((now_ms - last_arm_update_ms) * 0.001f);
  last_arm_update_ms = now_ms;

  applied_shoulder_rad = stepToward(
      applied_shoulder_rad,
      target_shoulder_rad,
      ARM_SHOULDER_RATE_RAD_S * dt_s);
  applied_elbow_rad = stepToward(
      applied_elbow_rad,
      target_elbow_rad,
      ARM_ELBOW_RATE_RAD_S * dt_s);

  moveArmToJointAngles(applied_shoulder_rad, applied_elbow_rad);

  if (fabsf(target_shoulder_rad - applied_shoulder_rad) <= ARM_JOINT_REACHED_EPS_RAD &&
      fabsf(target_elbow_rad - applied_elbow_rad) <= ARM_JOINT_REACHED_EPS_RAD) {
    applied_shoulder_rad = target_shoulder_rad;
    applied_elbow_rad = target_elbow_rad;
    moveArmToJointAngles(applied_shoulder_rad, applied_elbow_rad);
  }
}

static bool moveArmToXY(const DesiredArmPosition& cmd) {
  const auto joint_angles = inverseKinematics(
      cmd.xE,
      cmd.yE,
      ARM_BASE_X_M,
      ARM_BASE_Y_M,
      ARM_LINK_1_M,
      ARM_LINK_2_M);

  if (isnan(joint_angles.first) || isnan(joint_angles.second)) {
    Serial.println("ARM_UNREACHABLE");
    return false;
  }

  target_shoulder_rad = joint_angles.first;
  target_elbow_rad = joint_angles.second;
  has_valid_arm_target = true;

  Serial.print("ARM_ACK,");
  Serial.print(cmd.xE, 4);
  Serial.print(",");
  Serial.print(cmd.yE, 4);
  Serial.print(",");
  Serial.print(target_shoulder_rad * RAD_TO_DEG_FACTOR, 2);
  Serial.print(",");
  Serial.print(target_elbow_rad * RAD_TO_DEG_FACTOR, 2);
  Serial.print(",");
  Serial.print(applied_shoulder_rad * RAD_TO_DEG_FACTOR, 2);
  Serial.print(",");
  Serial.println(applied_elbow_rad * RAD_TO_DEG_FACTOR, 2);
  return true;
}

static void publishElevatorMeasurement(float height_m) {
  printDebugTiming("ELV_MEAS", last_meas_debug_ms);
  Serial.print("ELV_MEAS,");
  Serial.println(height_m, 4);

  const float encoder_position_rad = ELEVATOR_ENCODER_SIGN * elevator_encoder.getPosition();
  const float encoder_velocity_rad_s = ELEVATOR_ENCODER_SIGN * elevator_encoder.getVelocity();
  Serial.print("ELV_ENC,");
  Serial.print(encoder_position_rad, 4);
  Serial.print(",");
  Serial.print(encoder_velocity_rad_s, 4);
  Serial.print(",");
  if (encoder_height_initialized) {
    Serial.print(readEncoderHeightMeters(), 4);
  } else {
    Serial.print("nan");
  }
  Serial.print(",");
  if (!isnan(last_tof_height_m)) {
    Serial.println(last_tof_height_m, 4);
  } else {
    Serial.println("nan");
  }
}

