IanBallinger/Robotics_final_spring2026_thursPM/mobile_robot/src/esp32/src/elevator/elevator_control.cpp
static void stopElevator() {
  latest_rx_cmd = DesiredElevatorState();
  latest_applied_cmd = DesiredElevatorState();
  has_valid_elevator_cmd = false;
  wireless_elevator_jog_drive = 0.0f;
  ack_dirty = false;

  elevator_driver.drive(0.0);
}

void setup() {
  Serial.begin(115200);
  Wire.begin();
  setupElevatorWireless();

  if (ELEVATOR_USE_TOF_SENSOR) {
    tcaSelect(TOF_MUX_CHANNEL);
    tof_sensor_available = lox.begin();
    if (!tof_sensor_available) {
      Serial.println("ERR,VL53L0X_INIT_FAILED");
    }
  }

  elevator_driver.setup();
  pid.setParallelTunings(Kp, Ki, Kd, 0.1f, integral_min, integral_max);
  Serial.println("SETUP_PID");

  pinch_left_servo.setPeriodHertz(50);
  pinch_right_servo.setPeriodHertz(50);
  Serial.println("SETUP_ELBOW");
  Serial.println("SETUP_PINCH_L");
  Serial.println("SETUP_PINCH_R");

  // shoulder_servo.attach(ARM_SHOULDER_SERVO_PIN, SERVO_MIN_US, SERVO_MAX_US);
  // elbow_servo.attach(ARM_ELBOW_SERVO_PIN, SERVO_MIN_US, SERVO_MAX_US);
  pinch_left_servo.attach(PINCH_LEFT_SERVO_PIN, SERVO_MIN_US, SERVO_MAX_US);
  pinch_right_servo.attach(PINCH_RIGHT_SERVO_PIN, SERVO_MIN_US, SERVO_MAX_US);
  // moveArmToJointAngles(0.0f, 0.0f);
  commandPinch(PinchCommand::OPEN);
  applied_shoulder_rad = 0.0f;
  applied_elbow_rad = 0.0f;
  target_shoulder_rad = 0.0f;
  target_elbow_rad = 0.0f;

  const unsigned long now = millis();
  last_cmd_rx_ms = now;
  last_cmd_apply_ms = now;
  last_meas_publish_ms = now;
  last_ack_publish_ms = now;
  last_arm_update_ms = now;

  Serial.println("ELV_READY");
}

void loop() {
  while (Serial.available()) {
    char c = static_cast<char>(Serial.read());
    if (c == '\n') {
      rx_line.trim();
      DesiredElevatorState cmd;
      DesiredArmPosition arm_cmd;
      PinchCommand pinch_cmd = PinchCommand::OPEN;
      float measured_initial_height_m = NAN;
      if (rx_line.length() > 0) {
        if (handleElevatorCommand(rx_line, cmd)) {
          latest_rx_cmd = cmd;
          has_valid_elevator_cmd = true;
          last_cmd_rx_ms = millis();
          Serial.print("ELV_CMD_RX,target,");
          Serial.println(latest_rx_cmd.height_m, 4);
        } else if (handleEncoderHeightInitCommand(rx_line, measured_initial_height_m)) {
          initializeEncoderHeightReference(measured_initial_height_m);
          Serial.print("ELV_ENC_INIT_ACK,");
          Serial.println(readEncoderHeightMeters(), 4);
        } 
        // else if (handleArmCommand(rx_line, arm_cmd)) {
        //   latest_arm_cmd = arm_cmd;
        //   moveArmToXY(latest_arm_cmd);
        // } else 
        if (handlePinchCommand(rx_line, pinch_cmd)) {
          commandPinch(pinch_cmd);
        } else {
          DesiredArmJointAngles arm_joint_angles_cmd;
          if (handleArmJointAnglesCommand(rx_line, arm_joint_angles_cmd)) {
            latest_arm_joint_angles_cmd = arm_joint_angles_cmd;
            commandArmToJointAngles(latest_arm_joint_angles_cmd);
          } else {
            Serial.println("WRONG_START");
          }
        }
      }
      rx_line = "";
    } else {
      rx_line += c;
    }
  }

  const unsigned long now = millis();
  if (has_pending_wireless_pinch_cmd) {
    noInterrupts();
    const PinchCommand pinch_cmd = pending_wireless_pinch_cmd;
    has_pending_wireless_pinch_cmd = false;
    interrupts();
    commandPinch(pinch_cmd);
  }
  if (has_pending_wireless_elevator_jog_cmd) {
    noInterrupts();
    const float jog_drive = pending_wireless_elevator_jog_drive;
    has_pending_wireless_elevator_jog_cmd = false;
    interrupts();
    wireless_elevator_jog_drive = jog_drive;
    last_wireless_elevator_jog_ms = now;
    if (last_wireless_elevator_jog_update_ms == 0) {
      last_wireless_elevator_jog_update_ms = now;
    }
    Serial.print("ELV_JOG_ACK,");
    Serial.println(wireless_elevator_jog_drive, 3);
    Serial.print("ELV_JOG_DBG,drive,");
    Serial.print(wireless_elevator_jog_drive, 3);
    Serial.print(",target_before,");
    Serial.println(latest_rx_cmd.height_m, 4);
  }
  updateArmMotion(now);
  const float measured_height_m = readElevatorHeightMeters();

  if (now - last_wireless_elevator_jog_ms > CMD_TIMEOUT_MS) {
    if (fabsf(wireless_elevator_jog_drive) > 1e-4f) {
      Serial.println("ELV_JOG_TIMEOUT");
    }
    wireless_elevator_jog_drive = 0.0f;
  }

  if (now - last_cmd_rx_ms > CMD_TIMEOUT_MS && !has_valid_elevator_cmd && !isnan(measured_height_m)) {
    latest_rx_cmd = DesiredElevatorState(measured_height_m);
    has_valid_elevator_cmd = true;
    Serial.print("ELV_HOLD_INIT,timeout_hold_target,");
    Serial.println(latest_rx_cmd.height_m, 4);
  }

  float jog_dt_debug_s = 0.0f;
  if (!isnan(measured_height_m)) {
    if (!has_valid_elevator_cmd) {
      latest_rx_cmd = DesiredElevatorState(measured_height_m);
      has_valid_elevator_cmd = true;
      Serial.print("ELV_HOLD_INIT,measured_hold_target,");
      Serial.println(latest_rx_cmd.height_m, 4);
    }

    if (last_wireless_elevator_jog_update_ms == 0) {
      last_wireless_elevator_jog_update_ms = now;
    }
    const float dt_jog_s = (now > last_wireless_elevator_jog_update_ms)
                               ? ((now - last_wireless_elevator_jog_update_ms) * 0.001f)
                               : 0.0f;
    jog_dt_debug_s = dt_jog_s;
    last_wireless_elevator_jog_update_ms = now;

    if (fabsf(wireless_elevator_jog_drive) > 1e-4f) {
      const float target_before = latest_rx_cmd.height_m;
      latest_rx_cmd.height_m += wireless_elevator_jog_drive * ELEVATOR_JOG_RATE_MPS * dt_jog_s;
      Serial.print("ELV_JOG_STEP,before,");
      Serial.print(target_before, 4);
      Serial.print(",after,");
      Serial.print(latest_rx_cmd.height_m, 4);
      Serial.print(",drive,");
      Serial.print(wireless_elevator_jog_drive, 3);
      Serial.print(",dt_s,");
      Serial.println(dt_jog_s, 4);
    }
  }

  if (has_valid_elevator_cmd && now - last_cmd_apply_ms >= CMD_APPLY_PERIOD_MS) {
    if (!isnan(measured_height_m)) {
      applyElevatorCommand(latest_rx_cmd, measured_height_m, wireless_elevator_jog_drive, jog_dt_debug_s);
    } else {
      elevator_driver.drive(0.0);
      Serial.println("ELV_DBG,APPLY_SKIPPED,reason,no_measurement");
    }
    ack_dirty = true;
    last_cmd_apply_ms = now;
  }

  if (ack_dirty && now - last_ack_publish_ms >= ACK_PUBLISH_PERIOD_MS) {
    printElevatorAck(latest_applied_cmd);
    ack_dirty = false;
    last_ack_publish_ms = now;
  }

  if (!isnan(measured_height_m) && now - last_meas_publish_ms >= MEAS_PUBLISH_PERIOD_MS) {
    publishElevatorMeasurement(measured_height_m);
    last_meas_publish_ms = now;
  }
}
